zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_aon_event.h
// Field:   [5:0] AON_PROG0_EV
//
// Event selector for AON_PROG0 event.
//
// AON Event Source id# selecting event routed to EVENT as AON_PROG0 event.
// ENUMs:
// NONE
// AUX_COMPB_ASYNC_N
// AUX_COMPB_ASYNC
// BATMON_VOLT
// BATMON_TEMP
// AUX_TIMER1_EV
// AUX_TIMER0_EV
// AUX_TDC_DONE
// AUX_ADC_DONE
// AUX_COMPB
// AUX_COMPA
// AUX_SWEV2
// AUX_SWEV1
// AUX_SWEV0
// JTAG
// RTC_UPD
// RTC_COMB_DLY
// RTC_CH2_DLY
// RTC_CH1_DLY
// RTC_CH0_DLY
// RTC_CH2
// RTC_CH1
// RTC_CH0
// PAD
// BATMON_COMBINED
// BATMON_TEMP_LL
// BATMON_TEMP_UL
// BATMON_BATT_LL
// BATMON_BATT_UL
// AUX_TIMER2_EV3
// AUX_TIMER2_EV2
// AUX_TIMER2_EV1
// AUX_TIMER2_EV0
// IOEV_AON_PROG0           Edge detect IO event from the DIO(s) which have
//                          enabled contribution to IOEV_AON_PROG0 in
//                          [MCU_IOC:IOCFGx.IOEV_AON_PROG0_EN]
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_W                                  6
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_M                         0x0000003F
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_S                                  0
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_NONE                      0x0000003F
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_AUX_COMPB_ASYNC_N         0x00000038
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_AUX_COMPB_ASYNC           0x00000037
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_BATMON_VOLT               0x00000036
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_BATMON_TEMP               0x00000035
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_AUX_TIMER1_EV             0x00000034
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_AUX_TIMER0_EV             0x00000033
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_AUX_TDC_DONE              0x00000032
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_AUX_ADC_DONE              0x00000031
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_AUX_COMPB                 0x00000030
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_AUX_COMPA                 0x0000002F
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_AUX_SWEV2                 0x0000002E
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_AUX_SWEV1                 0x0000002D
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_AUX_SWEV0                 0x0000002C
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_JTAG                      0x0000002B
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_RTC_UPD                   0x0000002A
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_RTC_COMB_DLY              0x00000029
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_RTC_CH2_DLY               0x00000028
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_RTC_CH1_DLY               0x00000027
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_RTC_CH0_DLY               0x00000026
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_RTC_CH2                   0x00000025
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_RTC_CH1                   0x00000024
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_RTC_CH0                   0x00000023
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_PAD                       0x00000020
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_BATMON_COMBINED           0x00000009
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_BATMON_TEMP_LL            0x00000008
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_BATMON_TEMP_UL            0x00000007
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_BATMON_BATT_LL            0x00000006
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_BATMON_BATT_UL            0x00000005
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_AUX_TIMER2_EV3            0x00000004
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_AUX_TIMER2_EV2            0x00000003
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_AUX_TIMER2_EV1            0x00000002
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_AUX_TIMER2_EV0            0x00000001
#define AON_EVENT_EVTOMCUSEL_AON_PROG0_EV_IOEV_AON_PROG0            0x00000000

//*****************************************************************************
//
// Register: AON_EVENT_O_RTCSEL
//
//*****************************************************************************
// Field:   [5:0] RTC_CH1_CAPT_EV
//
// AON Event Source id# for RTCSEL event which is fed to AON_RTC. Please refer
// to AON_RTC:CH1CAPT
// ENUMs:
// NONE
// AUX_COMPB_ASYNC_N
// AUX_COMPB_ASYNC
// BATMON_VOLT
// BATMON_TEMP
// AUX_TIMER1_EV
// AUX_TIMER0_EV
// AUX_TDC_DONE
// AUX_ADC_DONE
// AUX_COMPB
// AUX_COMPA
// AUX_SWEV2
// AUX_SWEV1
// AUX_SWEV0
// JTAG
// RTC_UPD
// RTC_COMB_DLY
// RTC_CH2_DLY
// RTC_CH1_DLY
// RTC_CH0_DLY
// RTC_CH2
// RTC_CH1
// RTC_CH0
// PAD
// BATMON_COMBINED
// BATMON_TEMP_LL
// BATMON_TEMP_UL
// BATMON_BATT_LL
// BATMON_BATT_UL
// AUX_TIMER2_EV3
// AUX_TIMER2_EV2
// AUX_TIMER2_EV1
// AUX_TIMER2_EV0
// IOEV_RTC                 Edge detect IO event from the DIO(s) which have
//                          enabled contribution to IOEV_RTC in
//                          [MCU_IOC:IOCFGx.IOEV_RTC_EN]
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_W                                   6
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_M                          0x0000003F
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_S                                   0
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_NONE                       0x0000003F
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_AUX_COMPB_ASYNC_N          0x00000038
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_AUX_COMPB_ASYNC            0x00000037
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_BATMON_VOLT                0x00000036
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_BATMON_TEMP                0x00000035
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_AUX_TIMER1_EV              0x00000034
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_AUX_TIMER0_EV              0x00000033
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_AUX_TDC_DONE               0x00000032
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_AUX_ADC_DONE               0x00000031
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_AUX_COMPB                  0x00000030
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_AUX_COMPA                  0x0000002F
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_AUX_SWEV2                  0x0000002E
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_AUX_SWEV1                  0x0000002D
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_AUX_SWEV0                  0x0000002C
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_JTAG                       0x0000002B
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_RTC_UPD                    0x0000002A
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_RTC_COMB_DLY               0x00000029
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_RTC_CH2_DLY                0x00000028
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_RTC_CH1_DLY                0x00000027
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_RTC_CH0_DLY                0x00000026
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_RTC_CH2                    0x00000025
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_RTC_CH1                    0x00000024
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_RTC_CH0                    0x00000023
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_PAD                        0x00000020
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_BATMON_COMBINED            0x00000009
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_BATMON_TEMP_LL             0x00000008
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_BATMON_TEMP_UL             0x00000007
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_BATMON_BATT_LL             0x00000006
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_BATMON_BATT_UL             0x00000005
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_AUX_TIMER2_EV3             0x00000004
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_AUX_TIMER2_EV2             0x00000003
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_AUX_TIMER2_EV1             0x00000002
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_AUX_TIMER2_EV0             0x00000001
#define AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_IOEV_RTC                   0x00000000


#endif // __AON_EVENT__
